#### Terraform Plan 📝

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gcp_baseline.google_artifact_registry_repository.docker_repo will be created
  + resource "google_artifact_registry_repository" "docker_repo" {
      + create_time      = (known after apply)
      + description      = "Docker image repository for OryonTech application"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "oryontech-challenge-1770079166"
      + registry_uri     = (known after apply)
      + repository_id    = "oryontech-app"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.gcp_baseline.google_cloud_run_v2_service.app will be created
  + resource "google_cloud_run_v2_service" "app" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "staging-app"
      + observed_generation     = (known after apply)
      + project                 = "oryontech-challenge-1770079166"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + scaling (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/cloudrun/container/hello"

              + env {
                  + name  = "DB_NAME"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "staging-db-name"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "DB_PASSWORD"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "staging-db-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "DB_USER"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "staging-db-user"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "ENVIRONMENT"
                  + value = "staging"
                }
              + env {
                  + name  = "INSTANCE_CONNECTION_NAME"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "staging-db-connection-name"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "OPENAI_API_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "staging-openai-api-key"
                          + version = "latest"
                        }
                    }
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 30
                  + period_seconds        = 30
                  + timeout_seconds       = 3

                  + http_get {
                      + path = "/health"
                      + port = 8080
                    }
                }

              + ports (known after apply)

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 10
                  + period_seconds        = 10
                  + timeout_seconds       = 3

                  + http_get {
                      + path = "/health"
                      + port = 8080
                    }
                }
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }

          + vpc_access {
              + connector = (known after apply)
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.gcp_baseline.google_cloud_run_v2_service_iam_member.public_access[0] will be created
  + resource "google_cloud_run_v2_service_iam_member" "public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + name     = "staging-app"
      + project  = "oryontech-challenge-1770079166"
      + role     = "roles/run.invoker"
    }

  # module.gcp_baseline.google_compute_global_address.private_ip_address will be created
  + resource "google_compute_global_address" "private_ip_address" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "staging-private-ip"
      + network            = (known after apply)
      + prefix_length      = 16
      + project            = "oryontech-challenge-1770079166"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.gcp_baseline.google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_bgp_always_compare_med             = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "staging-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "oryontech-challenge-1770079166"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.gcp_baseline.google_compute_subnetwork.vpc_connector_subnet will be created
  + resource "google_compute_subnetwork" "vpc_connector_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.8.0.0/28"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "staging-vpc-connector-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "oryontech-challenge-1770079166"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # module.gcp_baseline.google_project_iam_member.cloud_run_sql_client will be created
  + resource "google_project_iam_member" "cloud_run_sql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
      + project = "oryontech-challenge-1770079166"
      + role    = "roles/cloudsql.client"
    }

  # module.gcp_baseline.google_project_service.required_apis["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "oryontech-challenge-1770079166"
      + service            = "artifactregistry.googleapis.com"
    }

  # module.gcp_baseline.google_project_service.required_apis["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "oryontech-challenge-1770079166"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # module.gcp_baseline.google_project_service.required_apis["compute.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "oryontech-challenge-1770079166"
      + service            = "compute.googleapis.com"
    }

  # module.gcp_baseline.google_project_service.required_apis["run.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "oryontech-challenge-1770079166"
      + service            = "run.googleapis.com"
    }

  # module.gcp_baseline.google_project_service.required_apis["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "oryontech-challenge-1770079166"
      + service            = "secretmanager.googleapis.com"
    }

  # module.gcp_baseline.google_project_service.required_apis["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "oryontech-challenge-1770079166"
      + service            = "servicenetworking.googleapis.com"
    }

  # module.gcp_baseline.google_project_service.required_apis["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "oryontech-challenge-1770079166"
      + service            = "sqladmin.googleapis.com"
    }

  # module.gcp_baseline.google_project_service.required_apis["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "oryontech-challenge-1770079166"
      + service            = "vpcaccess.googleapis.com"
    }

  # module.gcp_baseline.google_secret_manager_secret.db_connection_name will be created
  + resource "google_secret_manager_secret" "db_connection_name" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "oryontech-challenge-1770079166"
      + secret_id             = "staging-db-connection-name"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.gcp_baseline.google_secret_manager_secret.db_name will be created
  + resource "google_secret_manager_secret" "db_name" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "oryontech-challenge-1770079166"
      + secret_id             = "staging-db-name"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.gcp_baseline.google_secret_manager_secret.db_password will be created
  + resource "google_secret_manager_secret" "db_password" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "oryontech-challenge-1770079166"
      + secret_id             = "staging-db-password"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.gcp_baseline.google_secret_manager_secret.db_user will be created
  + resource "google_secret_manager_secret" "db_user" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "oryontech-challenge-1770079166"
      + secret_id             = "staging-db-user"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.gcp_baseline.google_secret_manager_secret.openai_api_key will be created
  + resource "google_secret_manager_secret" "openai_api_key" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "oryontech-challenge-1770079166"
      + secret_id             = "staging-openai-api-key"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.gcp_baseline.google_secret_manager_secret_iam_member.db_connection_name_access will be created
  + resource "google_secret_manager_secret_iam_member" "db_connection_name_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "staging-db-connection-name"
    }

  # module.gcp_baseline.google_secret_manager_secret_iam_member.db_name_access will be created
  + resource "google_secret_manager_secret_iam_member" "db_name_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "staging-db-name"
    }

  # module.gcp_baseline.google_secret_manager_secret_iam_member.db_password_access will be created
  + resource "google_secret_manager_secret_iam_member" "db_password_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "staging-db-password"
    }

  # module.gcp_baseline.google_secret_manager_secret_iam_member.db_user_access will be created
  + resource "google_secret_manager_secret_iam_member" "db_user_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "staging-db-user"
    }

  # module.gcp_baseline.google_secret_manager_secret_iam_member.openai_secret_access will be created
  + resource "google_secret_manager_secret_iam_member" "openai_secret_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "staging-openai-api-key"
    }

  # module.gcp_baseline.google_secret_manager_secret_version.db_connection_name_version will be created
  + resource "google_secret_manager_secret_version" "db_connection_name_version" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.gcp_baseline.google_secret_manager_secret_version.db_name_version will be created
  + resource "google_secret_manager_secret_version" "db_name_version" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.gcp_baseline.google_secret_manager_secret_version.db_password_version will be created
  + resource "google_secret_manager_secret_version" "db_password_version" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.gcp_baseline.google_secret_manager_secret_version.db_user_version will be created
  + resource "google_secret_manager_secret_version" "db_user_version" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.gcp_baseline.google_secret_manager_secret_version.openai_api_key_version will be created
  + resource "google_secret_manager_secret_version" "openai_api_key_version" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo         = (write-only attribute)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.gcp_baseline.google_service_account.cloud_run_sa will be created
  + resource "google_service_account" "cloud_run_sa" {
      + account_id   = "staging-cloud-run-sa"
      + description  = "Service account with least privilege for Cloud Run service to access Cloud SQL and secrets"
      + disabled     = false
      + display_name = "Cloud Run Service Account for staging"
      + email        = "staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "oryontech-challenge-1770079166"
      + unique_id    = (known after apply)
    }

  # module.gcp_baseline.google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "staging-private-ip",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.gcp_baseline.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = (known after apply)
      + name            = "oryontech_db"
      + project         = "oryontech-challenge-1770079166"
      + self_link       = (known after apply)
    }

  # module.gcp_baseline.google_sql_database_instance.postgres will be created
  + resource "google_sql_database_instance" "postgres" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = (known after apply)
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "oryontech-challenge-1770079166"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "us-central1"
      + replica_names                  = (known after apply)
      + root_password_wo               = (write-only attribute)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + replication_cluster (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "ZONAL"
          + connector_enforcement       = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 20
          + disk_type                   = "PD_SSD"
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + backup_tier                    = (known after apply)
              + enabled                        = true
              + point_in_time_recovery_enabled = true
              + start_time                     = "03:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + connection_pool_config (known after apply)

          + data_cache_config (known after apply)

          + database_flags {
              + name  = "log_connections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_disconnections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_duration"
              + value = "on"
            }
          + database_flags {
              + name  = "log_lock_waits"
              + value = "on"
            }

          + insights_config {
              + query_insights_enabled  = true
              + query_plans_per_minute  = (known after apply)
              + query_string_length     = 1024
              + record_application_tags = true
              + record_client_address   = true
            }

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = true
              + ipv4_enabled                                  = false
              + private_network                               = (known after apply)
              + server_ca_mode                                = (known after apply)
              + ssl_mode                                      = (known after apply)
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day          = 7
              + hour         = 4
              + update_track = "stable"
            }

          + read_pool_auto_scale_config (known after apply)
        }
    }

  # module.gcp_baseline.google_sql_user.db_user will be created
  + resource "google_sql_user" "db_user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = (known after apply)
      + name                    = "oryontech_user"
      + password                = (sensitive value)
      + password_wo             = (write-only attribute)
      + project                 = "oryontech-challenge-1770079166"
      + sql_server_user_details = (known after apply)
    }

  # module.gcp_baseline.google_vpc_access_connector.connector will be created
  + resource "google_vpc_access_connector" "connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + machine_type       = "e2-micro"
      + max_instances      = 3
      + max_throughput     = (known after apply)
      + min_instances      = 2
      + min_throughput     = (known after apply)
      + name               = "staging-vpc-connector"
      + network            = (known after apply)
      + project            = "oryontech-challenge-1770079166"
      + region             = "us-central1"
      + self_link          = (known after apply)
      + state              = (known after apply)

      + subnet {
          + name       = "staging-vpc-connector-subnet"
          + project_id = "oryontech-challenge-1770079166"
        }
    }

  # module.gcp_baseline.random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.gcp_baseline.random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 38 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloud_run_service_account = "staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
  + cloud_run_service_name    = "staging-app"
  + cloud_run_url             = (known after apply)
  + database_connection_name  = (known after apply)
  + database_instance_name    = (known after apply)
  + database_private_ip       = (sensitive value)
  + deployment_summary        = {
      + cloud_run_url       = (known after apply)
      + database_connection = (known after apply)
      + environment         = "staging"
      + region              = "us-central1"
      + service_account     = "staging-cloud-run-sa@oryontech-challenge-1770079166.iam.gserviceaccount.com"
      + vpc_connector       = "staging-vpc-connector"
    }
  + environment               = "staging"
  + project_id                = "oryontech-challenge-1770079166"
  + region                    = "us-central1"
  + secret_manager_secrets    = {
      + db_connection_name = "staging-db-connection-name"
      + db_name            = "staging-db-name"
      + db_password        = "staging-db-password"
      + db_user            = "staging-db-user"
      + openai_api_key     = "staging-openai-api-key"
    }
  + vpc_connector_name        = "staging-vpc-connector"
  + vpc_network_name          = "staging-vpc"

```

</details>

*Pusher: @OtowoSamuel, Action: `pull_request`*